---
kind: property
id: P:Autodesk.Revit.DB.Frame.Origin
zh: 原点
source: html/7899dacb-82bb-f1a6-b2fb-786aa2792f6f.htm
---
# Autodesk.Revit.DB.Frame.Origin Property

**中文**: 原点

The frame's base point.

## Syntax (C#)
```csharp
public XYZ Origin { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null